benchmarks/casesOF/2D/standingCapillaryWave/Cases/mycCartesian/mlpCurvature/coarse/AllrunParallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions
restore0Dir

runApplication blockMesh
runApplication setFields
runApplication setAlphaField
#runApplication $(getApplication)
decomposePar -force
mpirun -np 12 interIsoCartFoam -parallel >& log.interIsoCartFoam

#------------------------------------------------------------------------------
